In [6]:
import pandas as pd

# creating a dataframe with a list

In [4]:
data2 = [["haneefat","Adeola",25,"Data science"],["Tracy","Benson",22,"Designer"],
["Rachael","Bello",28,"Developer"],["Adeseye","Lanre",27,"Data science"]]

# creating a data frame

In [10]:
df=pd.DataFrame(data2, columns=["first name","last name","age","Department"])

In [11]:
#showing the dataframe
df

  first name last name  age    Department
0   haneefat    Adeola   25  Data science
1      Tracy    Benson   22      Designer
2    Rachael     Bello   28     Developer
3    Adeseye     Lanre   27  Data science

In [15]:
type(df)

pandas.core.frame.DataFrame

In [20]:
df=pd.DataFrame(data2, columns=["first name","last name","age","Department"],
index  =["A","B","C","D"])

In [21]:
df

  first name last name  age    Department
A   haneefat    Adeola   25  Data science
B      Tracy    Benson   22      Designer
C    Rachael     Bello   28     Developer
D    Adeseye     Lanre   27  Data science

# creating a dataframe with a dictionary

In [24]:
data3 ={"STATES":["kwara","oyo","lagos","benue"],
        "CAPITAL":["Ilorin","ibadan","ikeja","makurdi"]}

In [25]:
df_data3= pd.DataFrame(data3)

In [26]:
df_data3

  STATES  CAPITAL
0  kwara   Ilorin
1    oyo   ibadan
2  lagos    ikeja
3  benue  makurdi

# creating DataFrame using zip functions zip()

In [28]:
lst = ["adekunle","bayo","gravy","shayo","okoko","treasure"]
lst2 = [20,50,70,80,88,45]
list(zip(lst,lst2))

[('adekunle', 20),
 ('bayo', 50),
 ('gravy', 70),
 ('shayo', 80),
 ('okoko', 88),
 ('treasure', 45)]

In [32]:
df=pd.DataFrame(list(zip(lst,lst2)),columns=["names","marks"])
df

      names  marks
0  adekunle     20
1      bayo     50
2     gravy     70
3     shayo     80
4     okoko     88
5  treasure     45

# creating a dataframe using multidimensional list

In [35]:
lst= [["john","jude",20,40],
     ["faith","fegor",50,90],
     ["hanny","hanta",60,80],
      ["chris","camel",100,120]]
df=pd.DataFrame(lst,columns=["students","students","scores","scores"])
df

  students students  scores  scores
0     john     jude      20      40
1    faith    fegor      50      90
2    hanny    hanta      60      80
3    chris    camel     100     120